In [1]:
import pandas

# Sorting Data

In [2]:
dict_src={'First Name':['shivam','chitresh','abhilash'],'Last Name':['rana','pratap','singh'],'ID':['sss','ccc','aaa']}
df=pandas.DataFrame(dict_src)
df

  First Name Last Name   ID
0     shivam      rana  sss
1   chitresh    pratap  ccc
2   abhilash     singh  aaa

In [11]:
# How to sort data by First Name
df.sort_values(by='Last Name')

  First Name Last Name   ID
1   chitresh    pratap  ccc
0     shivam      rana  sss
2   abhilash     singh  aaa

In [5]:
# How to sort multiple sorting
df.sort_values(by=['First Name','Last Name'],ascending=False)

  First Name Last Name   ID
0     shivam      rana  sss
1   chitresh    pratap  ccc
2   abhilash     singh  aaa

In [12]:
df.sort_values(by=['First Name','Last Name'],ascending=[True,True],inplace=True)

In [14]:
# How to sort data by index
df.sort_index()

  First Name Last Name   ID
0     shivam      rana  sss
1   chitresh    pratap  ccc
2   abhilash     singh  aaa

In [15]:
# How to sort data in series object
df['First Name'].sort_values()

2    abhilash
1    chitresh
0      shivam
Name: First Name, dtype: object